#Задача 16:

import random
list_1 = []
n = int(input('Введите количество элементов: '))
for i in range(n):
        list_1.append(random.randint(-20,20))
print(list_1)
x = int(input('Введите элемент для проверки: '))
print('Количество вхождений: ',list_1.count(x))
#Задача 18:


#*Задача 20

